public_html/C-C++/C/C puzzles and faq.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C puzzles and FAQ</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="C puzzles and FAQ"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-26T23:03+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">C puzzles and FAQ</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">read() and write() truncate buffer length</a></li>
<li><a href="#sec-2">在宏定义中使用 do&hellip;while</a>
<ul>
<li><a href="#sec-2-1">do&hellip;while(0)消除goto语句</a></li>
</ul>
</li>
<li><a href="#sec-3">Swap</a></li>
<li><a href="#sec-4">指针数组和数组指针</a></li>
<li><a href="#sec-5">pointer</a></li>
<li><a href="#sec-6">the sizes of the standard types aren't precisely defined</a></li>
<li><a href="#sec-7">donot use gets()</a>
<ul>
<li><a href="#sec-7-1">Example 1</a></li>
</ul>
</li>
<li><a href="#sec-8">strings are represented as null-terminated arrays</a>
<ul>
<li><a href="#sec-8-1">Example 1</a></li>
</ul>
</li>
<li><a href="#sec-9">What is the significance of the keyword “volatile” in C?</a></li>
<li><a href="#sec-10">Scope rules in C</a></li>
<li><a href="#sec-11">What are the default values of static variables in C?</a></li>
<li><a href="#sec-12">Scansets in C</a>
<ul>
<li><a href="#sec-12-1">store only capital letters to character array ‘str’</a></li>
<li><a href="#sec-12-2">stop reading</a></li>
</ul>
</li>
<li><a href="#sec-13">What is use of %n in printf() ?</a></li>
<li><a href="#sec-14">Precedence of postfix ++ and prefix ++ in C/C++</a></li>
<li><a href="#sec-15">Modulus on Negative Numbers</a></li>
<li><a href="#sec-16">aa</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">read() and write() truncate buffer length</h2>
<div class="outline-text-2" id="text-1">


<p>
<a href="https://bugzilla.redhat.com/show_bug.cgi?id=612839">https://bugzilla.redhat.com/show_bug.cgi?id=612839</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">在宏定义中使用 do&hellip;while<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup></h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">do&hellip;while(0)消除goto语句</h3>
<div class="outline-text-3" id="text-2-1">

<p>通常，如果在一个函数中开始要分配一些资源，然后在中途执行过程中如果遇到
错误则退出函数，当然，退出前先释放资源，我们的代码可能是这样：
</p>
<ul>
<li id="sec-2-1-1">version 1<br/>



<pre class="src src-c"><span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">Execute</span>()
{
   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#20998;&#37197;&#36164;&#28304;</span>
   <span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">p</span> = new <span style="color: #98fb98;">int</span>;
   <span style="color: #98fb98;">bool</span> <span style="color: #eedd82;">bOk</span>(<span style="color: #7fffd4;">true</span>);

   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#25191;&#34892;&#24182;&#36827;&#34892;&#38169;&#35823;&#22788;&#29702;</span>
   bOk = func1();
   <span style="color: #00ffff;">if</span>(!bOk) 
   {
      <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
      p = <span style="color: #7fffd4;">NULL</span>;
      <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">false</span>;
   }

   bOk = func2();
   <span style="color: #00ffff;">if</span>(!bOk) 
   {
      <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
      p = <span style="color: #7fffd4;">NULL</span>;
      <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">false</span>;
   }

   bOk = func3();
   <span style="color: #00ffff;">if</span>(!bOk) 
   {
      <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
      p = <span style="color: #7fffd4;">NULL</span>;
      <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">false</span>;
   }

   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">..........</span>

   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#25191;&#34892;&#25104;&#21151;&#65292;&#37322;&#25918;&#36164;&#28304;&#24182;&#36820;&#22238;</span>
    <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
    p = <span style="color: #7fffd4;">NULL</span>;
    <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">true</span>;

}
</pre>

<p>
这里一个最大的问题就是代码的冗余，而且我每增加一个操作，就需要做相应的
错误处理，非常不灵活。于是我们想到了goto:
</p>
</li>
</ul>
<ul>
<li id="sec-2-1-2">version 2<br/>



<pre class="src src-c"><span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">Execute</span>()
{
   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#20998;&#37197;&#36164;&#28304;</span>
   <span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">p</span> = new <span style="color: #98fb98;">int</span>;
   <span style="color: #98fb98;">bool</span> <span style="color: #eedd82;">bOk</span>(<span style="color: #7fffd4;">true</span>);

   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#25191;&#34892;&#24182;&#36827;&#34892;&#38169;&#35823;&#22788;&#29702;</span>
   bOk = func1();
   <span style="color: #00ffff;">if</span>(!bOk) <span style="color: #00ffff;">goto</span> <span style="color: #7fffd4;">errorhandle</span>;

   bOk = func2();
   <span style="color: #00ffff;">if</span>(!bOk) <span style="color: #00ffff;">goto</span> <span style="color: #7fffd4;">errorhandle</span>;

   bOk = func3();
   <span style="color: #00ffff;">if</span>(!bOk) <span style="color: #00ffff;">goto</span> <span style="color: #7fffd4;">errorhandle</span>;

   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">..........</span>

   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#25191;&#34892;&#25104;&#21151;&#65292;&#37322;&#25918;&#36164;&#28304;&#24182;&#36820;&#22238;</span>
    <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
    p = <span style="color: #7fffd4;">NULL</span>;
    <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">true</span>;

<span style="color: #7fffd4;">errorhandle</span>:
    <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
    p = <span style="color: #7fffd4;">NULL</span>;
    <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">false</span>;

}
</pre>

<p>
代码冗余是消除了，但是我们引入了C++中身份比较微妙的goto语句，虽然正确
的使用goto可以大大提高程序的灵活性与简洁性，但太灵 活的东西往往是很危
险的，它会让我们的程序捉摸不定，那么怎么才能避免使用goto语句，又能消除
代码冗余呢，请看do&hellip;while(0)循环：
</p>
</li>
</ul>
<ul>
<li id="sec-2-1-3">version 3<br/>



<pre class="src src-c"><span style="color: #98fb98;">bool</span> <span style="color: #87cefa;">Execute</span>()
{
   <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#20998;&#37197;&#36164;&#28304;</span>
   <span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">p</span> = new <span style="color: #98fb98;">int</span>;

   <span style="color: #98fb98;">bool</span> <span style="color: #eedd82;">bOk</span>(<span style="color: #7fffd4;">true</span>);
   <span style="color: #00ffff;">do</span>
   {
      <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#25191;&#34892;&#24182;&#36827;&#34892;&#38169;&#35823;&#22788;&#29702;</span>
      bOk = func1();
      <span style="color: #00ffff;">if</span>(!bOk) <span style="color: #00ffff;">break</span>;

      bOk = func2();
      <span style="color: #00ffff;">if</span>(!bOk) <span style="color: #00ffff;">break</span>;

      bOk = func3();
      <span style="color: #00ffff;">if</span>(!bOk) <span style="color: #00ffff;">break</span>;

      <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">..........</span>

   }<span style="color: #00ffff;">while</span>(0);

    <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#37322;&#25918;&#36164;&#28304;</span>
    <span style="color: #98fb98;">delete</span> <span style="color: #eedd82;">p</span>;   
    p = <span style="color: #7fffd4;">NULL</span>;
    <span style="color: #00ffff;">return</span> bOk;

}
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Swap</h2>
<div class="outline-text-2" id="text-3">

<p> <b>swap1</b>
</p>


<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">swap1</span>(<span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">q1</span>,<span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">q2</span>)
{
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">temp</span>;
  temp = *q1;
  *q1 = *q2;
  *q2 = temp;
}
</pre>

<p>
 <b>swap2</b>
</p>


<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">swap2</span>(<span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">q1</span>, <span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">q2</span>)
{
  <span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">temp</span>;
  temp = q1;
  q1 = q2;
  q2 = temp;
}
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">指针数组和数组指针</h2>
<div class="outline-text-2" id="text-4">

<p><code>int *p[2];</code> 首先声明了一个数组，数组的元素是int型的指针。用于存储指针的
数组
</p>
<p>
<code>int (*p)[2];</code> 声明了一个指针， 指向了一个有两个int元素的数组。指向数组
的指针
</p>



<pre class="src src-c"><span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">int</span>* <span style="color: #98fb98;">intPtr</span>;
<span style="color: #98fb98;">intPtr</span> <span style="color: #eedd82;">p</span>[2];

<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">int</span> <span style="color: #98fb98;">intArray</span>[2];
<span style="color: #98fb98;">intArray</span> *<span style="color: #eedd82;">p</span>;
</pre>



<pre class="src src-c"><span style="color: #98fb98;">int</span> <span style="color: #eedd82;">array</span>[3][4] = {0,1,2,3,4,5,6,7,8,9,10,11};<span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">&#23450;&#20041;&#20108;&#32500;&#25968;&#32452;m&#24182;&#21021;&#22987;&#21270;</span><span style="color: #ff7f24;">*/</span>
<span style="color: #98fb98;">int</span> (*<span style="color: #eedd82;">p</span>)[4];<span style="color: #ff7f24;">/*</span><span style="color: #ff7f24;">&#25351;&#21521;&#25968;&#32452;&#30340;&#25351;&#38024;  p&#26159;&#25351;&#38024;&#65292;&#25351;&#21521;&#19968;&#32500;&#25968;&#32452;,&#27599;&#20010;&#19968;&#32500;&#25968;&#32452;&#26377;4&#20010;int&#20803;&#32032;</span><span style="color: #ff7f24;">*/</span>
<span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">q</span>[3];<span style="color: #ff7f24;">/*</span><span style="color: #ff7f24;">&#29992;&#20110;&#23384;&#20648;&#25351;&#38024;&#30340;&#25968;&#32452; q&#26159;&#25968;&#32452;&#65292;&#25968;&#32452;&#20803;&#32032;&#26159;&#25351;&#38024;&#65292;3&#20010;int&#25351;&#38024;</span><span style="color: #ff7f24;">*/</span>

p=m;    <span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">p&#26159;&#25351;&#38024;&#65292;&#21487;&#20197;&#30452;&#25509;&#25351;&#21521;&#20108;&#32500;&#25968;&#32452;</span>

<span style="color: #00ffff;">for</span>(i=0;i&lt;3;i++)
  q[i]=m[i];<span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">q&#26159;&#25968;&#32452;&#65292;&#20803;&#32032;q[i]&#26159;&#25351;&#38024;</span>
</pre>


</div>

</div>
