public_html/C-C++/C/C puzzles and faq.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">pointer</h2>
<div class="outline-text-2" id="text-5">

<p><a href="http://see.xidian.edu.cn/cpp/html/476.html">http://see.xidian.edu.cn/cpp/html/476.html</a>
<a href="http://see.xidian.edu.cn/cpp/html/477.html">http://see.xidian.edu.cn/cpp/html/477.html</a>
<a href="http://abruzzi.iteye.com/blog/416199">http://abruzzi.iteye.com/blog/416199</a>
<a href="http://topic.csdn.net/u/20080710/15/01ca0f15-4403-45c1-91a8-a0326ceed700.html">http://topic.csdn.net/u/20080710/15/01ca0f15-4403-45c1-91a8-a0326ceed700.html</a>
<a href="http://blog.csdn.net/qq515383106/article/details/7370241">http://blog.csdn.net/qq515383106/article/details/7370241</a>
<a href="http://blog.csdn.net/dtmine/article/details/7366750">http://blog.csdn.net/dtmine/article/details/7366750</a>
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">the sizes of the standard types aren't precisely defined</h2>
<div class="outline-text-2" id="text-6">

<p>Though C is considered relatively low-level as high-level languages
go, it does take the position that the exact size of an object (i.e.
in bits) is an implementation detail. Type int is supposed to
represent a machine's natural word size. 
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">donot use gets()</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">Example 1</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="src src-c"><span style="color: #98fb98;">char</span> <span style="color: #eedd82;">buf</span>[256];
gets(buf);
</pre>

<p>
One should never use gets, since there is no way to limit the amount of input it will
read. This leads to security problems(get the root priviledge). 
</p></div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">strings are represented as null-terminated arrays<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup></h2>
<div class="outline-text-2" id="text-8">

<p>It makes some confusing problems.
</p>
</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Example 1</h3>
<div class="outline-text-3" id="text-8-1">




<pre class="src src-c"><span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">p</span>, <span style="color: #eedd82;">buf</span>[256];
p = malloc(strlen(buf)+1);
strcpy(p, buf);
</pre>

<p>
<code>strlen</code> does not count the '\0' that terminates a string, while
<code>strcpy</code> copies it. So not enough space is allocated, and <code>strcpy</code> writes
past the end of the allocated space.
</p></div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">What is the significance of the keyword “volatile” in C?</h2>
<div class="outline-text-2" id="text-9">


<p>                
SOLUTION
Volatile informs the compiler that the value of the variable can
change from the outside, without any update done by the code.
Declaring a simple volatile variable:
</p>


<pre class="src src-c"><span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">x</span>;
<span style="color: #98fb98;">int</span> <span style="color: #00ffff;">volatile</span> <span style="color: #eedd82;">x</span>;
</pre>

<p>
Declaring a pointer variable for a volatile memory (only the pointer
address is volatile):
</p>


<pre class="src src-c"><span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">int</span> * <span style="color: #eedd82;">x</span>;
<span style="color: #98fb98;">int</span> <span style="color: #00ffff;">volatile</span> * <span style="color: #eedd82;">x</span>;
</pre>

<p>
Declaring a volatile pointer variable for a non-volatile memory (only
memory contained is volatile):
</p>


<pre class="src src-c"><span style="color: #98fb98;">int</span> * <span style="color: #00ffff;">volatile</span> <span style="color: #eedd82;">x</span>;
</pre>

<p>
Declaring a volatile variable pointer for a volatile memory (both
pointer address and memory contained are volatile):
</p>


<pre class="src src-c"><span style="color: #00ffff;">volatile</span> <span style="color: #98fb98;">int</span> * <span style="color: #00ffff;">volatile</span> <span style="color: #eedd82;">x</span>;
<span style="color: #98fb98;">int</span> <span style="color: #00ffff;">volatile</span> * <span style="color: #00ffff;">volatile</span> <span style="color: #eedd82;">x</span>;
</pre>

<p>
Volatile variables are not optimized, but this can actually be useful.
Imagine this function:
</p>


<pre class="src src-c"><span style="color: #98fb98;">int</span> <span style="color: #eedd82;">opt</span> = 1;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">Fn</span>(<span style="color: #98fb98;">void</span>) {

<span style="color: #7fffd4;">start</span>:

<span style="color: #00ffff;">if</span> (opt == 1) <span style="color: #00ffff;">goto</span> <span style="color: #7fffd4;">start</span>;

<span style="color: #00ffff;">else</span> <span style="color: #00ffff;">break</span>;
}
</pre>

<p>
At first glance, our code appears to loop infinitely. The compiler
will try to optimize it to:
</p>


<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">Fn</span>(<span style="color: #98fb98;">void</span>) {

<span style="color: #7fffd4;">start</span>:

<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">opt</span> = 1;

<span style="color: #00ffff;">if</span> (<span style="color: #7fffd4;">true</span>)

<span style="color: #00ffff;">goto</span> <span style="color: #7fffd4;">start</span>;
}
</pre>

<p>
This becomes an infinite loop. However, an external program might
write ‘0’ to the location of variable opt. Volatile variables are also
useful when multi-threaded programs have global variables and any
thread can modify these shared variables. Of course, we don’t want
optimization on them.
</p>
<p>
More:
</p><ul>
<li>Volatile: A programmer’s best friend:
  <a href="http://www.drdobbs.com/cpp/volatile-the-multithreaded-programmers-b/184403766">http://www.drdobbs.com/cpp/volatile-the-multithreaded-programmers-b/184403766</a>

</li>
<li>Do not use volatile as a synchronization primitive:
  <a href="https://www.securecoding.cert.org/confluence/display/cplusplus/CON01-CPP.+Do+not+use+volatile+as+a+synchronization+primitive">https://www.securecoding.cert.org/confluence/display/cplusplus/CON01-CPP.+Do+not+use+volatile+as+a+synchronization+primitive</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Scope rules in C</h2>
<div class="outline-text-2" id="text-10">

<p>Block Scope: A Block is a set of statements enclosed within left and
right braces ({ and } respectively). Blocks may be nested in C (a
block may contain other blocks inside it). A variable declared in a
block is accessible in the block and all inner blocks of that block,
but not accessible outside the block.
</p>
<p>
Can variables of block be accessed in another subsequent block?
</p>
<p>
No, a variabled declared in a block can only be accessed inside the
block and all inner blocks of this block. For example, following
program produces compiler error.
</p>



<pre class="src src-c"><span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>()
{
  {
      <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">x</span> = 10;
  }
  {
      printf(<span style="color: #ffa07a;">"%d"</span>, x);  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">Error: x is not accessible here</span>
  }
  <span style="color: #00ffff;">return</span> 0;
}
</pre>

<p>
Output:
<code>error: 'x' undeclared (first use in this function)</code>
</p>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">What are the default values of static variables in C?</h2>
<div class="outline-text-2" id="text-11">

<p>In C, if an object that has static storage duration is not initialized explicitly, then:
</p><ul>
<li>if it has pointer type, it is initialized to a NULL pointer;
</li>
<li>if it has arithmetic type, it is initialized to (positive or unsigned) zero;
</li>
<li>if it is an aggregate, every member is initialized (recursively) according to these rules;
</li>
<li>if it is a union, the first named member is initialized (recursively) according to these rules.
</li>
</ul>


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Scansets in C</h2>
<div class="outline-text-2" id="text-12">

<p>scanf family functions support scanset specifiers which are
represented by %[]. Inside scanset, we can specify single character or
range of characters. While processing scanset, scanf will process only
those characters which are part of scanset.
</p>

</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">store only capital letters to character array ‘str’</h3>
<div class="outline-text-3" id="text-12-1">




<pre class="src src-c"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">void</span>)
{
    <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">str</span>[128];

    printf(<span style="color: #ffa07a;">"Enter a string: "</span>);
    scanf(<span style="color: #ffa07a;">"%[A-Z]s"</span>, str);

    printf(<span style="color: #ffa07a;">"You entered: %s\n"</span>, str);

    <span style="color: #00ffff;">return</span> 0;
}
</pre>


<pre class="src src-sh"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">./scan-set </span>
Enter a string: WIKI_aa
You entered: WIKI
</pre>

</div>

</div>
