src/C-C++/C/C puzzles and faq.org
** stop reading
If first character of scanset is ‘^’, then the specifier will stop
reading after first occurence of that character.

#+begin_src c
#include <stdio.h>
 
int main(void)
{
    char str[128];
 
    printf("Enter a string: ");
    scanf("%[^o]s", str);
 
    printf("You entered: %s\n", str);
 
    return 0;
}
#+end_src
#+begin_src sh
#./scan-set
Enter a string: http://geeks for geeks
You entered: http://geeks f
#+end_src


* What is use of %n in printf() ?
In C printf(), %n is a special format specifier which instead of
printing something causes printf() to load the variable pointed by the
corresponding argument with a value equal to the number of characters
that have been printed by printf() before the occurrence of %n.

More printf:
http://swoolley.org/man.cgi/3/printf

#+begin_src c
#include<stdio.h>
 
int main()
{
  int c;
  printf("geeks for %ngeeks ", &c);
  printf("%d", c);
  getchar();
  return 0;
}
#+end_src

* Precedence of postfix ++ and prefix ++ in C/C++
In C/C++, precedence of Prefix ++ (or Prefix –) and dereference (*)
operators is same, and precedence of Postfix ++ (or Postfix –) is
higher than both Prefix ++ and *.

If p is a pointer then *p++ is equivalent to *(p++) and ++*p is
equivalent to ++(*p) (both Prefix ++ and * are right associative).
* Modulus on Negative Numbers
he emphasis is, sign of left operand is appended to result in case of
modulus operator in C.

* aa
#+begin_src c

#+end_src

* Footnotes

[fn:1] http://blog.csdn.net/carry1314lele/article/details/2191113

[fn:2] The Practice of Programming page 14



