public_html/C-C++/C/C puzzles and faq.html

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2">stop reading</h3>
<div class="outline-text-3" id="text-12-2">

<p>If first character of scanset is ‘<sup>’</sup>, then the specifier will stop
reading after first occurence of that character.
</p>



<pre class="src src-c"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>(<span style="color: #98fb98;">void</span>)
{
    <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">str</span>[128];

    printf(<span style="color: #ffa07a;">"Enter a string: "</span>);
    scanf(<span style="color: #ffa07a;">"%[^o]s"</span>, str);

    printf(<span style="color: #ffa07a;">"You entered: %s\n"</span>, str);

    <span style="color: #00ffff;">return</span> 0;
}
</pre>


<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">./scan-set</span>
Enter a string: http://geeks for geeks
You entered: http://geeks f
</pre>



</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">What is use of %n in printf() ?</h2>
<div class="outline-text-2" id="text-13">

<p>In C printf(), %n is a special format specifier which instead of
printing something causes printf() to load the variable pointed by the
corresponding argument with a value equal to the number of characters
that have been printed by printf() before the occurrence of %n.
</p>
<p>
More printf:
<a href="http://swoolley.org/man.cgi/3/printf">http://swoolley.org/man.cgi/3/printf</a>
</p>



<pre class="src src-c"><span style="color: #b0c4de;">#include</span><span style="color: #ffa07a;">&lt;stdio.h&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>()
{
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">c</span>;
  printf(<span style="color: #ffa07a;">"geeks for %ngeeks "</span>, &amp;c);
  printf(<span style="color: #ffa07a;">"%d"</span>, c);
  getchar();
  <span style="color: #00ffff;">return</span> 0;
}
</pre>


</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">Precedence of postfix ++ and prefix ++ in C/C++</h2>
<div class="outline-text-2" id="text-14">

<p>In C/C++, precedence of Prefix ++ (or Prefix –) and dereference (*)
operators is same, and precedence of Postfix ++ (or Postfix –) is
higher than both Prefix ++ and *.
</p>
<p>
If p is a pointer then *p++ is equivalent to *(p++) and ++*p is
equivalent to ++(*p) (both Prefix ++ and * are right associative).
</p></div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">Modulus on Negative Numbers</h2>
<div class="outline-text-2" id="text-15">

<p>he emphasis is, sign of left operand is appended to result in case of
modulus operator in C.
</p>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">aa</h2>
<div class="outline-text-2" id="text-16">




<pre class="src src-c"></pre>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="http://blog.csdn.net/carry1314lele/article/details/2191113">http://blog.csdn.net/carry1314lele/article/details/2191113</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> The Practice of Programming page 14
</p>


</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-26T23:03+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
